/*
 * sample-5.js
 * 吹き出し（情報ウィンドウ）を出す | Lopan.jp
 */



function initialize() {

  var currentwindow = null;

  var latlng = new google.maps.LatLng(38.678273561664, 141.4537811279297);
  var gmark = [];

  var myOptions = {
    zoom: 12,
    center: latlng,
    mapTypeId: google.maps.MapTypeId.ROADMAP
  };

  var map = new google.maps.Map(document.getElementById('map_canvas'), myOptions);

  var infolist = [
["ニュー泊崎荘","b1","141.5614757","38.6992055","0226-36-3315"],
["民宿　清観荘","b2","141.5590727","38.7055659","0226-36-2414"],
["平成の森　宿泊施設","b3","141.522305","38.7169443","0226-36-3115"],
["農漁家民宿　やすらぎ","b4","141.5227051","38.7109226","0226-36-3670"],
["校舎の宿　さんさん館","b5","141.4241095","38.7184107","0226-46-5633"],
["南三陸まなびの里　いりやど","b6","141.409184","38.7016757","0226-25-9501"],
["民宿　下道荘","b7","141.467639","38.6766107","0226-46-6318"],
["民宿　なか","b8","141.4685862","38.6763801","0226-46-6309"],
["南三陸ホテル観洋","b9","141.4475776","38.659651","0226-46-2442"],
["民宿　津の宮荘","b10","141.4815562","38.6424979","0226-46-9354"],
["民宿　ながしず荘","b11","141.5089734","38.6373437","0226-46-9248"],
["南三陸 竜巳や","r1","141.5304988","38.7190638","0226-25-9377"],
["山内鮮魚店　静江館","r2","141.4638915","38.6853097","0226-46-2159"],
["創菜旬魚　はしもと","r3","141.437816619873","38.6863137368836","0226-29-6343"],
["松原食堂","r4","141.439275741577","38.6863137368836","0226-46-2433"],
["季節料理　志のや","r5","141.436014175415","38.6871847016337","0226-47-1688"],
["豊楽食堂","r6","141.434640884399","38.6867157219318","0226-46-3512"],
["弁慶鮨","r7","141.435499191284","38.685509760012","0226-46-5141"],
["三陸味処　田中前","r8","141.440391540527","38.6863137368836","0226-25-9937"],
["南三陸観洋　レストランシーサイド","r9","141.4475776","38.659651","0226-46-2442"],
["オーイング菓子工房　Ryo","r10","141.4768621","38.6447586","090-9743-1333"],
["（株）三浦石油","gs","141.5164388","38.7142166","0226-36-2018"],
["（有）丸三石油","gs","141.5555838","38.7082878","0226-36-2510"],
["東京屋商事","gs","141.5566586","38.7135068","0226-36-2410"],
["（株）三興石油","gs","141.4436575","38.6750104","0226-46-5112"],
["ひころの里","s1","141.4226607","38.7001624","０２２６－４６－４３１０"],
["南三陸さんさん商店街","s2","141.4408293","38.686634"," "],
["ベイサイドアリーナ","s3","141.4614753","38.6804407",""],
["神割崎キャンプ場","s4","141.5278859","38.6343198","0226-46-9221"],
["伊里前福幸商店街","s5","141.5210384","38.7174887",""],
["平成の森","s6","141.5341736","38.7202638","0226-36-3115"],
  ];

  function mapgenerate(i){
    var data = infolist[i];
    var latlng = new google.maps.LatLng(data[3], data[2]);
    var content = '<div id="infoWindow">' +
      '<h1>'+data[0]+'</h1>' +
      '<p> 電話番号　:　'+data[4]+'</p>' +
      '</div>';

    var infowindow = new google.maps.InfoWindow({
      content: content
    });

    var image = 'pin/'+ data[1] +'.png';

    var lopanMarker = new google.maps.Marker({
      position: latlng,
      map: map,
      icon: image,
      title: data[0]
    });

    google.maps.event.addListener(lopanMarker, 'click', function() {

      if(currentwindow){
        currentwindow.close();
      }
      infowindow.open(map, lopanMarker);
      var open = i;
      currentwindow = infowindow;
    });

  }



  for ( var i = 0; i < infolist.length; ++i )  {
    mapgenerate(i);
  }


}

function map_click() {
  infowindow.close();
}

google.maps.event.addDomListener(window, 'load', initialize);
